Revit 2027 API
EnergyAnalysisSurface.GetAnalyticalOpenings Method
 Returns the analytical openings of the analytical surface.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<EnergyAnalysisOpening> GetAnalyticalOpenings()
Public Function GetAnalyticalOpenings As IList(Of EnergyAnalysisOpening)
public:
IList<EnergyAnalysisOpening^>^ GetAnalyticalOpenings()
member GetAnalyticalOpenings : unit -> IList<EnergyAnalysisOpening>
Return Value
IList<EnergyAnalysisOpening>
 The collection of analytical openings.
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace